In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

# Index

In [60]:
drinks=pd.read_csv('D:/临时/drinks.csv')

In [61]:
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

In [62]:
drinks.index

RangeIndex(start=0, stop=193, step=1)

In [63]:
drinks.columns

Index(['country', 'beer_servings', 'spirit_servings', 'wine_servings',
       'total_litres_of_pure_alcohol', 'continent'],
      dtype='object')

In [64]:
drinks[drinks.continent=='South America']

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
6,Argentina,193,25,221,8.3,South America
20,Bolivia,167,41,8,3.8,South America
23,Brazil,245,145,16,7.2,South America
35,Chile,130,124,172,7.6,South America
37,Colombia,159,76,3,4.2,South America
52,Ecuador,162,74,3,4.2,South America
72,Guyana,93,302,1,7.1,South America
132,Paraguay,213,117,74,7.3,South America
133,Peru,163,160,21,6.1,South America
163,Suriname,128,178,7,5.6,South America
185,Uruguay,115,35,220,6.6,South America
188,Venezuela,333,100,3,7.7,South America

In [65]:
drinks.loc[23,'beer_servings']        #如何精准定位呢，如下改变index

245

In [66]:
drinks.set_index('country',inplace=True)
drinks.head()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
country,,,,,
Afghanistan,0,0,0,0.0,Asia
Albania,89,132,54,4.9,Europe
Algeria,25,0,14,0.7,Africa
Andorra,245,138,312,12.4,Europe
Angola,217,57,45,5.9,Africa

In [67]:
drinks.loc['Brazil','beer_servings']

245

In [68]:
drinks.index.name=None         #无法删去index
drinks.head()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
Afghanistan,0,0,0,0.0,Asia
Albania,89,132,54,4.9,Europe
Algeria,25,0,14,0.7,Africa
Andorra,245,138,312,12.4,Europe
Angola,217,57,45,5.9,Africa

In [69]:
drinks.index.name='country'    #没有这行会怎么样
drinks.reset_index(inplace=True)
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

In [70]:
drinks.describe().index

Index(['count', 'mean', 'std', 'min', '25%', '50%', '75%', 'max'], dtype='object')

In [71]:
drinks.describe().columns

Index(['beer_servings', 'spirit_servings', 'wine_servings',
       'total_litres_of_pure_alcohol'],
      dtype='object')

In [72]:
drinks.continent.head()

0      Asia
1    Europe
2    Africa
3    Europe
4    Africa
Name: continent, dtype: object

In [73]:
drinks.continent.value_counts()  #这是一个Series

Africa           53
Europe           45
Asia             44
North America    23
Oceania          16
South America    12
Name: continent, dtype: int64

In [74]:
drinks.continent.value_counts().values   #Series.values

array([53, 45, 44, 23, 16, 12], dtype=int64)

In [76]:
drinks.continent.value_counts()['Africa']

53

In [77]:
drinks.continent.value_counts().sort_values

<bound method Series.sort_values of Africa           53
Europe           45
Asia             44
North America    23
Oceania          16
South America    12
Name: continent, dtype: int64>

In [78]:
drinks.continent.value_counts().sort_index

<bound method Series.sort_index of Africa           53
Europe           45
Asia             44
North America    23
Oceania          16
South America    12
Name: continent, dtype: int64>

* <font color=FireBrick size=5 face="黑体">计算Albania,Andorra两地的beer_servings 的值（平均值*人口值）</font>

In [88]:
drinks=pd.read_csv('D:/临时/drinks.csv')
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

In [89]:
drinks.set_index('country',inplace=True)
drinks.head()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
country,,,,,
Afghanistan,0,0,0,0.0,Asia
Albania,89,132,54,4.9,Europe
Algeria,25,0,14,0.7,Africa
Andorra,245,138,312,12.4,Europe
Angola,217,57,45,5.9,Africa

In [90]:
people=pd.Series([30000,5000],index=['Albania','Andorra'],name='population')
people

Albania    30000
Andorra     5000
Name: population, dtype: int64

In [91]:
drinks.beer_servings.head()

country
Afghanistan      0
Albania         89
Algeria         25
Andorra        245
Angola         217
Name: beer_servings, dtype: int64

In [93]:
drinks.beer_servings*people        #答案

Afghanistan                   NaN
Albania                 2670000.0
Algeria                       NaN
Andorra                 1225000.0
Angola                        NaN
Antigua & Barbuda             NaN
Argentina                     NaN
Armenia                       NaN
Australia                     NaN
Austria                       NaN
Azerbaijan                    NaN
Bahamas                       NaN
Bahrain                       NaN
Bangladesh                    NaN
Barbados                      NaN
Belarus                       NaN
Belgium                       NaN
Belize                        NaN
Benin                         NaN
Bhutan                        NaN
Bolivia                       NaN
Bosnia-Herzegovina            NaN
Botswana                      NaN
Brazil                        NaN
Brunei                        NaN
Bulgaria                      NaN
Burkina Faso                  NaN
Burundi                       NaN
Cabo Verde                    NaN
Cambodia                      NaN
                          ...
Sudan                         NaN
Suriname                      NaN
Swaziland                     NaN
Sweden                        NaN
Switzerland                   NaN
Syria                         NaN
Tajikistan                    NaN
Tanzania                      NaN
Thailand                      NaN
Timor-Leste                   NaN
Togo                          NaN
Tonga                         NaN
Trinidad & Tobago             NaN
Tunisia                       NaN
Turkey                        NaN
Turkmenistan                  NaN
Tuvalu                        NaN
USA                           NaN
Uganda                        NaN
Ukraine                       NaN
United Arab Emirates          NaN
United Kingdom                NaN
Uruguay                       NaN
Uzbekistan                    NaN
Vanuatu                       NaN
Venezuela                     NaN
Vietnam                       NaN
Yemen                         NaN
Zambia                        NaN
Zimbabwe                      NaN
Length: 193, dtype: float64

In [96]:
sum_AA=drinks.beer_servings*people
sum_AA.dropna()

Albania    2670000.0
Andorra    1225000.0
dtype: float64

* 怎么把people加入到表中呢

In [97]:
pd.concat([drinks,people],axis=1).head()

D:\Anaconda\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent,population
Afghanistan,0,0,0,0.0,Asia,NaN
Albania,89,132,54,4.9,Europe,30000.0
Algeria,25,0,14,0.7,Africa,NaN
Andorra,245,138,312,12.4,Europe,5000.0
Angola,217,57,45,5.9,Africa,NaN

# MultiIndex

In [2]:
stocks=pd.read_csv('D:/临时/stocks.csv')
stocks

         Date   Close    Volume Symbol
0  2016-10-03   31.50  14070500   CSCO
1  2016-10-03  112.52  21701800   AAPL
2  2016-10-03   57.42  19189500   MSFT
3  2016-10-04  113.00  29736800   AAPL
4  2016-10-04   57.24  20085900   MSFT
5  2016-10-04   31.35  18460400   CSCO
6  2016-10-05   57.64  16726400   MSFT
7  2016-10-05   31.59  11808600   CSCO
8  2016-10-05  113.05  21453100   AAPL

In [3]:
stocks.index

RangeIndex(start=0, stop=9, step=1)

In [4]:
stocks.groupby('Symbol').Close.mean()

Symbol
AAPL    112.856667
CSCO     31.480000
MSFT     57.433333
Name: Close, dtype: float64

In [6]:
ser=stocks.groupby(['Symbol','Date']).Close.mean()
ser

Symbol  Date
AAPL    2016-10-03    112.52
        2016-10-04    113.00
        2016-10-05    113.05
CSCO    2016-10-03     31.50
        2016-10-04     31.35
        2016-10-05     31.59
MSFT    2016-10-03     57.42
        2016-10-04     57.24
        2016-10-05     57.64
Name: Close, dtype: float64

In [8]:
ser.index         #这是一个MULTINDEX

MultiIndex(levels=[['AAPL', 'CSCO', 'MSFT'], ['2016-10-03', '2016-10-04', '2016-10-05']],
           codes=[[0, 0, 0, 1, 1, 1, 2, 2, 2], [0, 1, 2, 0, 1, 2, 0, 1, 2]],
           names=['Symbol', 'Date'])

In [9]:
ser.unstack()

Date    2016-10-03  2016-10-04  2016-10-05
Symbol
AAPL        112.52      113.00      113.05
CSCO         31.50       31.35       31.59
MSFT         57.42       57.24       57.64

In [13]:
df=stocks.pivot_table(values='Close',index='Symbol',columns='Date')
df   #同样效果

Date    2016-10-03  2016-10-04  2016-10-05
Symbol
AAPL        112.52      113.00      113.05
CSCO         31.50       31.35       31.59
MSFT         57.42       57.24       57.64

## Select

In [14]:
ser.loc['AAPL']

Date
2016-10-03    112.52
2016-10-04    113.00
2016-10-05    113.05
Name: Close, dtype: float64

In [16]:
ser.loc['AAPL','2016-10-03' ]

112.52

In [18]:
ser.loc[:,'2016-10-03' ]

Symbol
AAPL    112.52
CSCO     31.50
MSFT     57.42
Name: Close, dtype: float64

## Creat

In [19]:
stocks.set_index(['Symbol','Date'],inplace=True)
stocks

                    Close    Volume
Symbol Date
CSCO   2016-10-03   31.50  14070500
AAPL   2016-10-03  112.52  21701800
MSFT   2016-10-03   57.42  19189500
AAPL   2016-10-04  113.00  29736800
MSFT   2016-10-04   57.24  20085900
CSCO   2016-10-04   31.35  18460400
MSFT   2016-10-05   57.64  16726400
CSCO   2016-10-05   31.59  11808600
AAPL   2016-10-05  113.05  21453100

In [20]:
stocks.index

MultiIndex(levels=[['AAPL', 'CSCO', 'MSFT'], ['2016-10-03', '2016-10-04', '2016-10-05']],
           codes=[[1, 0, 2, 0, 2, 1, 2, 1, 0], [0, 0, 0, 1, 1, 1, 2, 2, 2]],
           names=['Symbol', 'Date'])

In [21]:
stocks.sort_index(inplace=True)
stocks

                    Close    Volume
Symbol Date
AAPL   2016-10-03  112.52  21701800
       2016-10-04  113.00  29736800
       2016-10-05  113.05  21453100
CSCO   2016-10-03   31.50  14070500
       2016-10-04   31.35  18460400
       2016-10-05   31.59  11808600
MSFT   2016-10-03   57.42  19189500
       2016-10-04   57.24  20085900
       2016-10-05   57.64  16726400

In [22]:
stocks.loc['AAPL']

             Close    Volume
Date
2016-10-03  112.52  21701800
2016-10-04  113.00  29736800
2016-10-05  113.05  21453100

In [23]:
stocks.loc[('AAPL','2016-10-03'),'Close']

112.52

In [24]:
stocks.loc[('AAPL','2016-10-03'),:]

Close          112.52
Volume    21701800.00
Name: (AAPL, 2016-10-03), dtype: float64

In [25]:
stocks.loc[(['AAPL','MSFT'],'2016-10-03'),:]

                    Close    Volume
Symbol Date
AAPL   2016-10-03  112.52  21701800
MSFT   2016-10-03   57.42  19189500

In [26]:
stocks.loc[(['AAPL','MSFT'],'2016-10-03'),'Close']

Symbol  Date
AAPL    2016-10-03    112.52
MSFT    2016-10-03     57.42
Name: Close, dtype: float64

In [27]:
stocks.loc[('AAPL',['2016-10-03','2016-10-04']),:]

                    Close    Volume
Symbol Date
AAPL   2016-10-03  112.52  21701800
       2016-10-04  113.00  29736800

In [28]:
stocks.loc[(:,['2016-10-03','2016-10-04']),:]   #想选择所有的公司，这样不行

SyntaxError: invalid syntax (<ipython-input-28-4416e5418f54>, line 1)

In [29]:
stocks.loc[(slice(None),['2016-10-03','2016-10-04']),:]

                    Close    Volume
Symbol Date
AAPL   2016-10-03  112.52  21701800
       2016-10-04  113.00  29736800
CSCO   2016-10-03   31.50  14070500
       2016-10-04   31.35  18460400
MSFT   2016-10-03   57.42  19189500
       2016-10-04   57.24  20085900

## Merge

In [33]:
close=pd.read_csv('D:/临时/stocks.csv',usecols=[0,1,3],index_col=['Symbol','Date'])

In [34]:
close

                    Close
Symbol Date
CSCO   2016-10-03   31.50
AAPL   2016-10-03  112.52
MSFT   2016-10-03   57.42
AAPL   2016-10-04  113.00
MSFT   2016-10-04   57.24
CSCO   2016-10-04   31.35
MSFT   2016-10-05   57.64
CSCO   2016-10-05   31.59
AAPL   2016-10-05  113.05

In [31]:
volume=pd.read_csv('D:/临时/stocks.csv',usecols=[0,2,3],index_col=['Symbol','Date'])

In [32]:
volume

                     Volume
Symbol Date
CSCO   2016-10-03  14070500
AAPL   2016-10-03  21701800
MSFT   2016-10-03  19189500
AAPL   2016-10-04  29736800
MSFT   2016-10-04  20085900
CSCO   2016-10-04  18460400
MSFT   2016-10-05  16726400
CSCO   2016-10-05  11808600
AAPL   2016-10-05  21453100

In [37]:
both=pd.merge(close,volume,left_index=True,right_index=True)

In [38]:
both

                    Close    Volume
Symbol Date
CSCO   2016-10-03   31.50  14070500
AAPL   2016-10-03  112.52  21701800
MSFT   2016-10-03   57.42  19189500
AAPL   2016-10-04  113.00  29736800
MSFT   2016-10-04   57.24  20085900
CSCO   2016-10-04   31.35  18460400
MSFT   2016-10-05   57.64  16726400
CSCO   2016-10-05   31.59  11808600
AAPL   2016-10-05  113.05  21453100